## pandas练习

[中文网](https://www.pypandas.cn/docs/getting_started/10min.html)

### 创建

In [1]:
import numpy as np
import pandas as pd

In [8]:
# 打印版本
print(pd.__version__)

0.25.1

In [16]:
# series 是一维列表
s0 = pd.Series([1,2,3])
pd.date_range('20130101', periods=6)
# 通过列表生成
# np.nan为空
l = [1,2,3,4,4,np.nan]
pd.Series(l)
# 通过dict生成series
d = dict({'a': 1, 'b': 2, 'c': 3})
s2 = pd.Series(d)

# randn从标准正态分布中返回一个或多个样本值
# ABCD为列名，index为行标
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
# 使用dict为每列指定值
df2 = pd.DataFrame({'A': 1.,
             'B': pd.Timestamp('20130102'),
             'C': pd.Series(1, index=list(range(4)), dtype='float32'),
             'D': np.array([3] * 4, dtype='int32'),
             'E': pd.Categorical(["test", "train", "test", "train"]),
             'F': 'foo'})

TypeError: 'PandasArray' object is not callable

### 数据转换

In [ ]:
# series 转 dataframe
# dict key为row名
d1 = s2.to_frame()

# 一维的可转为数组
df.columns.array(dtype=object)

# 转为numpy对象
# numpy的每个数组类型相同，pandas要求每列类型相同，numpy的行 = pandas的列
# Pandas不需要像Numpy那样所有元素的类型都相同
df.to_numpy()

In [17]:
# 设置列名及索引名
s0.name = 'num'
s3 = pd.Series([21, 34],index=["a","b"])
# s5元素是否在s2中，返回布尔值
s3.isin(s0)
# 计算每个值的个数
print(s0.value_counts())

# 重新设置行名
df.reset_index(inplace=True)
# 显示类型
df2.dtypes
# 转换为numpy数组
# 属性，没有括号
df2.values

s = pd.Series(np.random.randint(1,10,3), index=['a','b','c'])
s.index
s.reindex(['b','a','4'])
s.reindex(['b','a','4'], fill_value=5)

3    1
2    1
1    1
Name: num, dtype: int64

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

### 数据探索

In [38]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df.head(2)
df.tail(1)
# 查看行
df.index
# 显示列名
df.columns

                   A         B         C         D
2013-01-01 -0.417904  0.866346  1.368557 -1.024122
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373

In [44]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.417904   -0.912168   -0.156880    0.253530   -0.951443    0.193722
B    0.866346    1.264569    0.829811   -0.722991    1.070261    0.177029
C    1.368557   -1.224098   -1.236148    0.175343   -1.284378   -0.731740
D   -1.024122   -0.427373    0.678302    0.907482    0.276310    0.841263

In [49]:
# 安轴排序，axis=1列，0 行
df.sort_index(axis=1,ascending=False)

                   D         C         B         A
2013-01-01 -1.024122  1.368557  0.866346 -0.417904
2013-01-02 -0.427373 -1.224098  1.264569 -0.912168
2013-01-03  0.678302 -1.236148  0.829811 -0.156880
2013-01-04  0.907482  0.175343 -0.722991  0.253530
2013-01-05  0.276310 -1.284378  1.070261 -0.951443
2013-01-06  0.841263 -0.731740  0.177029  0.193722

In [47]:
# 按列排序
df.sort_values(by='B')

                   A         B         C         D
2013-01-04  0.253530 -0.722991  0.175343  0.907482
2013-01-06  0.193722  0.177029 -0.731740  0.841263
2013-01-03 -0.156880  0.829811 -1.236148  0.678302
2013-01-01 -0.417904  0.866346  1.368557 -1.024122
2013-01-05 -0.951443  1.070261 -1.284378  0.276310
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373

### 选择与赋值

#### 数据选择

df['A']
df.A：在某些运算中使用df['A']会报错
df.loc['A']: 更新中需要使用

In [50]:
# 等同于 df.A
# 选择A列，返回series
df['A']

2013-01-01   -0.417904
2013-01-02   -0.912168
2013-01-03   -0.156880
2013-01-04    0.253530
2013-01-05   -0.951443
2013-01-06    0.193722
Freq: D, Name: A, dtype: float64

In [51]:
# 0~3行
df[0:3]

                   A         B         C         D
2013-01-01 -0.417904  0.866346  1.368557 -1.024122
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373
2013-01-03 -0.156880  0.829811 -1.236148  0.678302

In [52]:
df['2013-01-01':'2013-01-02']

                   A         B         C         D
2013-01-01 -0.417904  0.866346  1.368557 -1.024122
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373

In [53]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [55]:
# 安标签选择
df.loc[dates[0]]

A   -0.417904
B    0.866346
C    1.368557
D   -1.024122
Name: 2013-01-01 00:00:00, dtype: float64

In [57]:
# 行列选择
df.loc[:,['B','C']]

                   B         C
2013-01-01  0.866346  1.368557
2013-01-02  1.264569 -1.224098
2013-01-03  0.829811 -1.236148
2013-01-04 -0.722991  0.175343
2013-01-05  1.070261 -1.284378
2013-01-06  0.177029 -0.731740

In [58]:
df.loc[dates[0], 'A']

-0.41790415501683875

In [60]:
 # 返回标量时，效果等同
df.at[dates[0], 'A']

-0.41790415501683875

In [61]:
# 通过位置选择，
# 返回第二行数据
df.iloc[2]

A   -0.156880
B    0.829811
C   -1.236148
D    0.678302
Name: 2013-01-03 00:00:00, dtype: float64

In [64]:
# 前闭后开
df.iloc[0:2,2:3]

                   C
2013-01-01  1.368557
2013-01-02 -1.224098

In [66]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.912168 -1.224098
2013-01-03 -0.156880 -1.236148
2013-01-05 -0.951443 -1.284378

In [67]:
# 返回标量
# 等同于df.iloc
df.iat[1,1]

1.26456929256184

In [68]:
# 布尔索引
# 返回A列大于0的数据
df[df.A>0]

                   A         B         C         D
2013-01-04  0.253530 -0.722991  0.175343  0.907482
2013-01-06  0.193722  0.177029 -0.731740  0.841263

In [69]:
# 对小于0的置为nan
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.866346  1.368557       NaN
2013-01-02       NaN  1.264569       NaN       NaN
2013-01-03       NaN  0.829811       NaN  0.678302
2013-01-04  0.253530       NaN  0.175343  0.907482
2013-01-05       NaN  1.070261       NaN  0.276310
2013-01-06  0.193722  0.177029       NaN  0.841263

In [74]:
# capy 与赋值
df2 = df.copy()
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01 -0.417904  0.866346  1.368557 -1.024122    one
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373    one
2013-01-03 -0.156880  0.829811 -1.236148  0.678302    two
2013-01-04  0.253530 -0.722991  0.175343  0.907482  three
2013-01-05 -0.951443  1.070261 -1.284378  0.276310   four
2013-01-06  0.193722  0.177029 -0.731740  0.841263  three

In [75]:
# 使用列表选择
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -0.156880  0.829811 -1.236148  0.678302   two
2013-01-05 -0.951443  1.070261 -1.284378  0.276310  four

In [328]:
# 添加一列
df.loc[:,'A']=np.array(['a','b','c','d','e','f','g','h','i','j'])
# 将该列设置为index
df4 = df.set_index('A')
df4.loc[:,'B']=np.array(np.random.randint(10,size=len(df)))
# 每列判断
(df4 > 0).all()
# 所有判断
(df4 > 0).all().all()

False

#### 赋值

In [81]:
# 对单个元素赋值
df.at[dates[0],'E']='five'
df.loc[dates[0]]

A   -0.417904
B    0.866346
C     1.36856
D    -1.02412
E        five
Name: 2013-01-01 00:00:00, dtype: object

In [90]:
# 位置赋值
df.iat[1,4]='one'

In [91]:
df.iat[1,4]
df

                   A         B         C         D    E  F
2013-01-01 -0.417904  0.866346  1.368557 -1.024122  one  5
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373  one  5
2013-01-03 -0.156880  0.829811 -1.236148  0.678302  NaN  5
2013-01-04  0.253530 -0.722991  0.175343  0.907482  NaN  5
2013-01-05 -0.951443  1.070261 -1.284378  0.276310  NaN  5
2013-01-06  0.193722  0.177029 -0.731740  0.841263  NaN  5

In [86]:
# 给某列（行）赋值
df.loc[:,'F']=np.array([5]*len(df))
df

                   A         B         C         D    E  F
2013-01-01 -0.417904  0.866346  1.368557 -1.024122  one  5
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373  NaN  5
2013-01-03 -0.156880  0.829811 -1.236148  0.678302  NaN  5
2013-01-04  0.253530 -0.722991  0.175343  0.907482  NaN  5
2013-01-05 -0.951443  1.070261 -1.284378  0.276310  NaN  5
2013-01-06  0.193722  0.177029 -0.731740  0.841263  NaN  5

In [94]:
# 某列赋值
df.iloc[:,4]=0.1
df

                   A         B         C         D    E  F
2013-01-01 -0.417904  0.866346  1.368557 -1.024122  0.1  5
2013-01-02 -0.912168  1.264569 -1.224098 -0.427373  0.1  5
2013-01-03 -0.156880  0.829811 -1.236148  0.678302  0.1  5
2013-01-04  0.253530 -0.722991  0.175343  0.907482  0.1  5
2013-01-05 -0.951443  1.070261 -1.284378  0.276310  0.1  5
2013-01-06  0.193722  0.177029 -0.731740  0.841263  0.1  5

In [96]:
# 对大于0.5的数取反
df[df>0.5] = -df
df

                   A         B         C         D    E  F
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5
2013-01-03 -0.156880 -0.829811 -1.236148 -0.678302  0.1 -5
2013-01-04  0.253530 -0.722991  0.175343 -0.907482  0.1 -5
2013-01-05 -0.951443 -1.070261 -1.284378  0.276310  0.1 -5
2013-01-06  0.193722  0.177029 -0.731740 -0.841263  0.1 -5

In [121]:
# 更改/添加/删除指定轴上的索引，返回DataFrame副本
# 此处需使用list，不能使用[]
df1=df.reindex(index=dates[0:3],columns=list(df.columns) + ['G'])
df1

                   A         B         C         D   G
2013-01-01  1.451907  0.640174 -0.599387  0.113262 NaN
2013-01-02 -0.255341 -0.564264 -0.545468  0.601278 NaN
2013-01-03 -0.702170  0.085030  0.372809 -0.443714 NaN

In [109]:
df1.loc[0:2,'G'] = 0.99
df1

                   A         B         C         D    E  F     G
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5  0.99
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5  0.99
2013-01-03 -0.156880 -0.829811 -1.236148 -0.678302  0.1 -5  0.99

### 缺失值处理

In [115]:
df1.iloc[2,6]=np.nan
df1

                   A         B         C         D    E  F     G
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5  0.99
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5  0.99
2013-01-03 -0.156880 -0.829811 -1.236148 -0.678302  0.1 -5   NaN

In [116]:
# 删除缺失值所在的行，返回DataFrame副本
df1.dropna(how='any')

                   A         B         C         D    E  F     G
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5  0.99
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5  0.99

In [122]:
df1.iloc[1,6]=np.nan
df1

                   A         B         C         D    E  F     G
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5  0.99
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5   NaN
2013-01-03 -0.156880 -0.829811 -1.236148 -0.678302  0.1 -5   NaN

In [131]:
# 缺失值填充，返回DataFrame副本
df3 = df1.fillna(value=1.1)
df3

                   A         B         C         D    E  F     G
2013-01-01 -0.417904 -0.866346 -1.368557 -1.024122  0.1 -5  0.99
2013-01-02 -0.912168 -1.264569 -1.224098 -0.427373  0.1 -5  1.10
2013-01-03 -0.156880 -0.829811 -1.236148 -0.678302  0.1 -5  1.10

In [132]:
pd.isna(df1)

                A      B      C      D      E      F      G
2013-01-01  False  False  False  False  False  False  False
2013-01-02  False  False  False  False  False  False   True
2013-01-03  False  False  False  False  False  False   True

### 连续值离散化

In [24]:
# 等宽法 → 将数据均匀划分成n等份，每份的间距相等
# cut方法
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
# 有一组人员年龄数据，希望将这些数据划分为“18到25”,“26到35”,“36到60”,“60以上”几个面元
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
# pd.cut(df['ages'],5),将数据等分为5份
# type(cats): <class 'pandas.core.categorical.Categorical'>
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [26]:
# 可以设置自己的区间名称，用labels参数
group_names=['Youth','YoungAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [32]:
# 0-3对应分组后的四个区间，用代号来注释数据对应区间，结果为ndarray
cats.codes, type(cats.codes)

(array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8), numpy.ndarray)

In [33]:
cats.categories, type(cats.categories) # 四个区间，结果为index

(IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
               closed='right',
               dtype='interval[int64]'),
 pandas.core.indexes.interval.IntervalIndex)

### 统计与数值计算

In [260]:
s = pd.Series(np.arange(10))

In [261]:
# 取整与取模
d,m = divmod(s,3)

In [133]:
# 均值
df.mean()

A   -0.331857
B   -0.762825
C   -0.944930
D   -0.600372
E    0.100000
F   -5.000000
dtype: float64

In [136]:
# 1为横轴上的均值
df.mean(1)

2013-01-01   -1.429488
2013-01-02   -1.454701
2013-01-03   -1.300190
2013-01-04   -1.016933
2013-01-05   -1.321629
2013-01-06   -1.017042
Freq: D, dtype: float64

In [22]:
# 设置四分位值
# 设置随机种子
state = np.random.RandomState(0)
# 正态分布，均值5，方差2，10个数
sn = pd.Series(state.normal(5, 2, 10))
print(sn)

0    8.528105
1    5.800314
2    6.957476
3    9.481786
4    8.735116
5    3.045444
6    6.900177
7    4.697286
8    4.793562
9    5.821197
dtype: float64

In [245]:
# 显示快速统计信息
df.describe()

               0          1          2          3
count  10.000000  10.000000  10.000000  10.000000
mean    0.297832   0.461350   0.257232   0.138174
std     0.947081   1.464363   0.929456   0.659203
min    -1.789854  -1.652491  -1.251903  -0.908897
25%     0.292624  -0.783454  -0.168110  -0.190343
50%     0.677026   0.375724   0.351692  -0.005857
75%     0.837059   1.855057   0.682396   0.318781
max     1.136195   2.454022   1.746998   1.463438

In [19]:
# 分组统计
'''
# 按 sex分组，取age列并求均值
# 参数：
    as_index    : Sex是否作为index
    by          : 可以为'col', ['col1', 'col2'...]
# 相关方法：
    value_count : 计算每个value的数量
    group       : 查看分组
    agg         : .agg(['mean','std','count','max']) 
    filter      : filter(lambda x: len(x) >= 3))
    transform   : f = lambda x: (x - x.mean()) / x.std()
                  df.groupby('col').transform(f)
# 遍历：
    grouped = df.groupby('Team')
    for name,group in grouped:
        print(name)
        print(group)
'''
df3 = pd.DataFrame({'A':['foo', 'bar', 'foo', 'bar','foo', 'bar', 'foo', 'foo'],
                     'B':['one', 'one', 'two', 'three','two', 'two', 'one', 'three'],
                     'C':np.random.randn(8),
                     'D': np.random.randn(8)})
df3.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -0.241404  1.462188
    three -1.068199  0.326462
    two   -0.525750 -1.364865
foo one   -0.111539 -0.675261
    three  0.079008  0.933199
    two    1.847694  0.791764

In [21]:
df3['A'].value_counts()

foo    5
bar    3
Name: A, dtype: int64

### 组间操作

In [237]:
# 数据平移
# 平移2个单位，以0.5填充
s1.shift(periods=2, fill_value=0.5)

0    0.5
1    0.5
2    1.0
3    2.0
4    3.0
5    4.0
dtype: float64

In [298]:
# 两索引对应元素相减
# 等同于 df - df1
df1=df.iloc[3,:]
# print(df,df1)
df.sub(df1)

          0         1         2         3
0 -2.527798  1.972608  1.517390  0.009590
1  0.398250  2.083822  0.568437 -0.328234
2  0.299259  3.795925  0.516901  0.029673
3  0.000000  0.000000  0.000000  0.000000
4 -0.407985  4.106514  0.768017  1.488927
5 -1.721672  0.706694 -1.060925 -0.219806
6 -0.121837  1.356067 -0.765664  0.265802
7  0.129017  3.749694  0.908492  0.903656
8 -0.457766  0.585977  1.937975  0.370425
9  0.009408  2.781112  0.091471 -0.883408

In [297]:
# 会返回整列数据，且转为行数据
# 若为DF类型，则对应元素相减
# 若为Series，即只是一维，会被广播后相减
df2 = df.iloc[:,1]
df.sub(df2)

          0         1         2         3   4   5   6   7   8   9
0 -2.109970 -0.111214 -0.817021  1.636593 NaN NaN NaN NaN NaN NaN
1  0.816078  0.000000 -1.765974  1.298769 NaN NaN NaN NaN NaN NaN
2  0.717087  1.712103 -1.817510  1.656675 NaN NaN NaN NaN NaN NaN
3  0.417828 -2.083822 -2.334411  1.627003 NaN NaN NaN NaN NaN NaN
4  0.009842  2.022692 -1.566394  3.115929 NaN NaN NaN NaN NaN NaN
5 -1.303845 -1.377128 -3.395336  1.407197 NaN NaN NaN NaN NaN NaN
6  0.295991 -0.727755 -3.100075  1.892804 NaN NaN NaN NaN NaN NaN
7  0.546845  1.665872 -1.425919  2.530659 NaN NaN NaN NaN NaN NaN
8 -0.039938 -1.497845 -0.396436  1.997428 NaN NaN NaN NaN NaN NaN
9  0.427236  0.697290 -2.242940  0.743594 NaN NaN NaN NaN NaN NaN

In [299]:
# 对应元素相加
df + df1

          0         1         2         3
0 -1.051909 -1.332375  1.135435 -0.041387
1  1.874139 -1.221161  0.186482 -0.379210
2  1.775148  0.490942  0.134946 -0.021304
3  1.475889 -3.304983 -0.381955 -0.050977
4  1.067904  0.801531  0.386062  1.437950
5 -0.245783 -2.598289 -1.442880 -0.270783
6  1.354052 -1.948916 -1.147619  0.214825
7  1.604906  0.444711  0.526537  0.852679
8  1.018123 -2.719006  1.556020  0.319448
9  1.485297 -0.523871 -0.290484 -0.934385

In [29]:
# 追加
# 连接另一个Index对象，产生一个新的Index
# ignor_index，忽略原index重新编号
df.append(s, ignore_index=True)

           0         1         2         3
0   0.754032  0.677725  0.073082 -0.485943
1   0.234150  0.424778  1.054017 -1.134895
2   0.046864  1.197583 -0.311357 -0.704134
3   1.179834 -1.009507  0.659446  1.965002
4   0.448982 -0.131815 -0.316225  1.439959
5  -1.133739 -0.470134  1.500557 -1.790577
6   0.022969  1.075286 -0.173415  0.123043
7   0.949730 -0.644031  0.159734  1.202233
8   0.655096  1.257217  0.024702 -0.224156
9  -0.174001  0.223326  0.447804  0.004802
10  1.179834 -1.009507  0.659446  1.965002

In [239]:
# 每列相加
df.apply(np.cumsum)

          0         1         2         3
0  0.304328 -0.914028  0.907540 -0.981840
1  1.715638 -2.248895  2.395584 -0.459771
2  1.355115 -2.240476  1.997220 -0.990619
3  2.319917 -2.542995  3.900959 -1.189674
4  1.243502 -3.315092  2.485684 -0.979095
5  1.106240 -3.825776  2.398418 -2.190570
6 -1.675614 -3.302357  3.087635 -2.358388
7 -1.986241 -4.227788  2.757011 -2.662482
8 -1.304272 -3.944935  3.438192 -2.168699
9 -1.075126 -4.406502  2.751119 -1.957089

In [242]:
df = pd.DataFrame(np.random.randn(10,4))
# 前3行，拿出3到7行，7行以后
p = [df[0:3],df[3:5],df[7:]]
p

[          0         1         2         3
 0 -1.789854  0.320117  1.326413 -0.015899
 1  1.136195  0.431331  0.377460 -0.353722
 2  1.037204  2.143433  0.325924  0.004184,
           0         1         2         3
 3  0.737944 -1.652491 -0.190978 -0.025488
 4  0.329959  2.454022  0.577040  1.463438,
           0         1         2         3
 7  0.866961  2.097203  0.717515  0.878168
 8  0.280178 -1.066514  1.746998  0.344937
 9  0.747352  1.128621 -0.099506 -0.908897]

#### union 与 join

In [ ]:
# 合并 union
pd.concat(p)

In [197]:
# join
left=pd.DataFrame({'k':['foo1','foo2'], 'v':[1,2]})
right=pd.DataFrame({'k':['foo1','foo2'],'v':[3,4]})
left.merge(right, on='k')

      k  v_x  v_y
0  foo1    1    3
1  foo2    2    4

In [198]:
# full join 
left=pd.DataFrame({'k':['foo','foo'], 'v':[1,2]})
right=pd.DataFrame({'k':['foo','foo'],'v':[3,4]})
left.merge(right, on='k')

     k  v_x  v_y
0  foo    1    3
1  foo    1    4
2  foo    2    3
3  foo    2    4

In [28]:
s = df.iloc[3]
s

0    1.179834
1   -1.009507
2    0.659446
3    1.965002
Name: 3, dtype: float64

#### 复合索引

In [124]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
   ....:                      'foo', 'foo', 'qux', 'qux'],
   ....:                     ['one', 'two', 'one', 'two',
   ....:                      'one', 'two', 'one', 'two']]))

# 多级索引的使用
# 以上星号 * 将两行每个元素相互连接 
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
index

MultiIndex([('bar', 'one'),
            ('bar', 'two'),
            ('baz', 'one'),
            ('baz', 'two'),
            ('foo', 'one'),
            ('foo', 'two'),
            ('qux', 'one'),
            ('qux', 'two')],
           names=['first', 'second'])

In [125]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df

                     A         B
first second
bar   one     1.443253  0.513281
      two     1.009509 -1.550507
baz   one     0.113932 -0.774026
      two    -0.787236 -0.459357
foo   one     0.205778 -0.918723
      two    -0.607163  0.013304
qux   one    -0.971208  0.761925
      two    -1.390123  1.205986

##### 列转行，行转列

In [40]:
# 将列名转为索引名
df1=df.stack()
df1

first  second
bar    one     A   -0.328031
               B   -1.819669
       two     A   -1.251759
               B   -1.507566
baz    one     A   -0.740245
               B    0.474763
       two     A   -0.258776
               B    0.280771
foo    one     A    1.290434
               B    0.342820
       two     A    0.249182
               B   -1.675491
qux    one     A    0.368704
               B    0.769709
       two     A    0.941099
               B    0.592239
dtype: float64

In [42]:
df1.unstack()

                     A         B
first second
bar   one    -0.328031 -1.819669
      two    -1.251759 -1.507566
baz   one    -0.740245  0.474763
      two    -0.258776  0.280771
foo   one     1.290434  0.342820
      two     0.249182 -1.675491
qux   one     0.368704  0.769709
      two     0.941099  0.592239

In [43]:
# 以某一维展开
df1.unstack(1)

second        one       two
first
bar   A -0.328031 -1.251759
      B -1.819669 -1.507566
baz   A -0.740245 -0.258776
      B  0.474763  0.280771
foo   A  1.290434  0.249182
      B  0.342820 -1.675491
qux   A  0.368704  0.941099
      B  0.769709  0.592239

### 时间序列与透视表

In [58]:
# 生成时间序列
# periods 生成数量
# freq 时间间隔，S秒，T分，D填，M月
dt = pd.date_range('20191001',periods=100,freq='T')
dt

DatetimeIndex(['2019-10-01 00:00:00', '2019-10-01 00:01:00',
               '2019-10-01 00:02:00', '2019-10-01 00:03:00',
               '2019-10-01 00:04:00', '2019-10-01 00:05:00',
               '2019-10-01 00:06:00', '2019-10-01 00:07:00',
               '2019-10-01 00:08:00', '2019-10-01 00:09:00',
               '2019-10-01 00:10:00', '2019-10-01 00:11:00',
               '2019-10-01 00:12:00', '2019-10-01 00:13:00',
               '2019-10-01 00:14:00', '2019-10-01 00:15:00',
               '2019-10-01 00:16:00', '2019-10-01 00:17:00',
               '2019-10-01 00:18:00', '2019-10-01 00:19:00',
               '2019-10-01 00:20:00', '2019-10-01 00:21:00',
               '2019-10-01 00:22:00', '2019-10-01 00:23:00',
               '2019-10-01 00:24:00', '2019-10-01 00:25:00',
               '2019-10-01 00:26:00', '2019-10-01 00:27:00',
               '2019-10-01 00:28:00', '2019-10-01 00:29:00',
               '2019-10-01 00:30:00', '2019-10-01 00:31:00',
               '2019-10-01 00:32:00', '2019-10-01 00:33:00',
               '2019-10-01 00:34:00', '2019-10-01 00:35:00',
               '2019-10-01 00:36:00', '2019-10-01 00:37:00',
               '2019-10-01 00:38:00', '2019-10-01 00:39:00',
               '2019-10-01 00:40:00', '2019-10-01 00:41:00',
               '2019-10-01 00:42:00', '2019-10-01 00:43:00',
               '2019-10-01 00:44:00', '2019-10-01 00:45:00',
               '2019-10-01 00:46:00', '2019-10-01 00:47:00',
               '2019-10-01 00:48:00', '2019-10-01 00:49:00',
               '2019-10-01 00:50:00', '2019-10-01 00:51:00',
               '2019-10-01 00:52:00', '2019-10-01 00:53:00',
               '2019-10-01 00:54:00', '2019-10-01 00:55:00',
               '2019-10-01 00:56:00', '2019-10-01 00:57:00',
               '2019-10-01 00:58:00', '2019-10-01 00:59:00',
               '2019-10-01 01:00:00', '2019-10-01 01:01:00',
               '2019-10-01 01:02:00', '2019-10-01 01:03:00',
               '2019-10-01 01:04:00', '2019-10-01 01:05:00',
               '2019-10-01 01:06:00', '2019-10-01 01:07:00',
               '2019-10-01 01:08:00', '2019-10-01 01:09:00',
               '2019-10-01 01:10:00', '2019-10-01 01:11:00',
               '2019-10-01 01:12:00', '2019-10-01 01:13:00',
               '2019-10-01 01:14:00', '2019-10-01 01:15:00',
               '2019-10-01 01:16:00', '2019-10-01 01:17:00',
               '2019-10-01 01:18:00', '2019-10-01 01:19:00',
               '2019-10-01 01:20:00', '2019-10-01 01:21:00',
               '2019-10-01 01:22:00', '2019-10-01 01:23:00',
               '2019-10-01 01:24:00', '2019-10-01 01:25:00',
               '2019-10-01 01:26:00', '2019-10-01 01:27:00',
               '2019-10-01 01:28:00', '2019-10-01 01:29:00',
               '2019-10-01 01:30:00', '2019-10-01 01:31:00',
               '2019-10-01 01:32:00', '2019-10-01 01:33:00',
               '2019-10-01 01:34:00', '2019-10-01 01:35:00',
               '2019-10-01 01:36:00', '2019-10-01 01:37:00',
               '2019-10-01 01:38:00', '2019-10-01 01:39:00'],
              dtype='datetime64[ns]', freq='T')

In [56]:
ts = pd.Series(np.random.randint(0,500,len(dt)),index=dt)
ts

2019-10-01 00:00:00    484
2019-10-01 00:01:00    379
2019-10-01 00:02:00    182
2019-10-01 00:03:00    113
2019-10-01 00:04:00    120
                      ...
2019-10-01 01:35:00    206
2019-10-01 01:36:00    480
2019-10-01 01:37:00     16
2019-10-01 01:38:00     13
2019-10-01 01:39:00     95
Freq: T, Length: 100, dtype: int32

##### 采样

In [57]:
# 采样
ts.resample('5T').sum()

2019-10-01 00:00:00    1278
2019-10-01 00:05:00    1643
2019-10-01 00:10:00    1279
2019-10-01 00:15:00     818
2019-10-01 00:20:00    1210
2019-10-01 00:25:00    1149
2019-10-01 00:30:00    1391
2019-10-01 00:35:00    1246
2019-10-01 00:40:00    1495
2019-10-01 00:45:00    1688
2019-10-01 00:50:00    1146
2019-10-01 00:55:00    1220
2019-10-01 01:00:00    1243
2019-10-01 01:05:00    1688
2019-10-01 01:10:00    1575
2019-10-01 01:15:00    1487
2019-10-01 01:20:00     400
2019-10-01 01:25:00    1328
2019-10-01 01:30:00    1497
2019-10-01 01:35:00     810
Freq: 5T, dtype: int32

#### 时区转换

In [62]:
dt = pd.date_range('2019-10-01',periods=5,freq='D')
dtU= dt.tz_localize('UTC')
dtU

DatetimeIndex(['2019-10-01 00:00:00+00:00', '2019-10-02 00:00:00+00:00',
               '2019-10-03 00:00:00+00:00', '2019-10-04 00:00:00+00:00',
               '2019-10-05 00:00:00+00:00'],
              dtype='datetime64[ns, UTC]', freq='D')

In [63]:
dtU.tz_convert('US/Eastern')

DatetimeIndex(['2019-09-30 20:00:00-04:00', '2019-10-01 20:00:00-04:00',
               '2019-10-02 20:00:00-04:00', '2019-10-03 20:00:00-04:00',
               '2019-10-04 20:00:00-04:00'],
              dtype='datetime64[ns, US/Eastern]', freq='D')

In [69]:
# 跨度统计
pt = dt.to_period('M')
pt

PeriodIndex(['2019-10', '2019-10', '2019-10', '2019-10', '2019-10'], dtype='period[M]', freq='M')

In [71]:
pt.to_timestamp()

DatetimeIndex(['2019-10-01', '2019-10-01', '2019-10-01', '2019-10-01',
               '2019-10-01'],
              dtype='datetime64[ns]', freq=None)

In [72]:
# 通过周期生成时间序列
pt = pd.period_range('2013Q1','2019Q4',freq='Q-Nov')
pt

PeriodIndex(['2013Q1', '2013Q2', '2013Q3', '2013Q4', '2014Q1', '2014Q2',
             '2014Q3', '2014Q4', '2015Q1', '2015Q2', '2015Q3', '2015Q4',
             '2016Q1', '2016Q2', '2016Q3', '2016Q4', '2017Q1', '2017Q2',
             '2017Q3', '2017Q4', '2018Q1', '2018Q2', '2018Q3', '2018Q4',
             '2019Q1', '2019Q2', '2019Q3', '2019Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [78]:
ts = pd.Series(np.random.randn(len(pt)), pt)
ts.index = (pt.asfreq('M', 'e') + 1).asfreq('H', 's') + 9
ts.head(5)

2013-03-01 09:00   -1.209047
2013-06-01 09:00   -1.438270
2013-09-01 09:00    0.623484
2013-12-01 09:00   -0.075095
2014-03-01 09:00   -0.284449
Freq: H, dtype: float64

In [81]:
df = pd.DataFrame({"id": [1, 2, 3, 4, 5, 6],
   .....:                    "raw_grade": ['a', 'b', 'b', 'a', 'a', 'e']})
   .....: 
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [99]:
df["grade"] = df["raw_grade"].astype('category')
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [103]:
# 重命名分类名
df["grade"].cat.categories = ["very good", "good", "very bad"]
df

   id raw_grade      grade grade_1
0   1         a  very good     NaN
1   2         b       good     NaN
2   3         b       good     NaN
3   4         a  very good     NaN
4   5         a  very good     NaN
5   6         e   very bad     NaN

In [104]:
df.groupby("grade").size()

grade
very good    3
good         2
very bad     1
dtype: int64

### 输入输出操作

In [106]:
# 写操作
df.to_csv("foo.csv")
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [107]:
# 读操作
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])
pandas.read_csv("foo.csv", dtype=data_types, parse_dates=['hour'],date_parser=parser)
sep=','   # 以，为数据分隔符
dtype=data_types # 指定数据类型，可以使用字典指定所有字段
shkiprows= 10   # 跳过前十行
nrows = 10   # 只去前10行
parse_dates = ['col_name']   # 指定某行读取为日期格式
index_col = ['col_1','col_2']   # 读取指定的几列
error_bad_lines = False   # 当某行数据有问题时，不报错，直接跳过，处理脏数据时使用
date_parser=parser # 自定义日期解析器
na_values = 'NULL'   # 将NULL识别为空值

   Unnamed: 0  id raw_grade      grade  grade_1
0           0   1         a  very good      NaN
1           1   2         b       good      NaN
2           2   3         b       good      NaN
3           3   4         a  very good      NaN
4           4   5         a  very good      NaN
5           5   6         e   very bad      NaN